# PANDAS

In [40]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Creating Dataframe

In [41]:
df = pd.read_csv("marks.csv")
df

     date       exam  stat  math  coms  total
0  1/1/21  internal1    29    32    30     91
1  2/1/21  internal2    35    39    30    104
2  3/1/21  internal3    32    32    25     89
3  4/1/21  internal4    15    21     7     43
4  5/1/21  internal5    37    21    40     98
5  6/1/21  internal6    21    39    30     90
6  7/1/21  internal7    20    32    20     72
7  8/1/21  internal8    35    40    10     85

# Functions

## 1. df.shape
## 2. df.columns
## 3. df.head() and df.tail()
## 4. df[a:b]
## 5. df['column_name']
## 6. df.column_name
## 7. df.[['column_a','column_b','column_c']]
## 8. df.column_name.max() , df.column_name.min() , df.column_name.mean(), df.column_name.std() , df.column_name.describe()
## 9. df[df.column_a >= x] , df[df.column_a == df.column_a.max()] , etc
## 10. df['column_a'][df.column_b == df.column_b.max()]
## 11. df.set_index()

In [42]:
df.shape

(8, 6)

df.shape gives the order of the matrix i.e., number of rows and columns in the data

In [43]:
rows,columns = df.shape
rows

8

In [6]:
columns

6

In [44]:
df.head()

     date       exam  stat  math  coms  total
0  1/1/21  internal1    29    32    30     91
1  2/1/21  internal2    35    39    30    104
2  3/1/21  internal3    32    32    25     89
3  4/1/21  internal4    15    21     7     43
4  5/1/21  internal5    37    21    40     98

df.head() gives the first 5 rows of the data. 
Use df.head(n) to get first n rows of the data.
And
df.tail() gives the last 5 rows of the data.

In [45]:
df.tail()

     date       exam  stat  math  coms  total
3  4/1/21  internal4    15    21     7     43
4  5/1/21  internal5    37    21    40     98
5  6/1/21  internal6    21    39    30     90
6  7/1/21  internal7    20    32    20     72
7  8/1/21  internal8    35    40    10     85

In [46]:
df.head(3)

     date       exam  stat  math  coms  total
0  1/1/21  internal1    29    32    30     91
1  2/1/21  internal2    35    39    30    104
2  3/1/21  internal3    32    32    25     89

In [47]:
df[2:6]

     date       exam  stat  math  coms  total
2  3/1/21  internal3    32    32    25     89
3  4/1/21  internal4    15    21     7     43
4  5/1/21  internal5    37    21    40     98
5  6/1/21  internal6    21    39    30     90

df[a:b] gives the data from (a)th row to (b-1)th row.

In [48]:
df.columns

Index(['date', 'exam', 'stat', 'math', 'coms', 'total'], dtype='object')

df.columns gives all the column headings in the data.

In [49]:
df.exam

0    internal1
1    internal2
2    internal3
3    internal4
4    internal5
5    internal6
6    internal7
7    internal8
Name: exam, dtype: object

In [50]:
df.coms

0    30
1    30
2    25
3     7
4    40
5    30
6    20
7    10
Name: coms, dtype: int64

In [51]:
df[['exam','math']]

        exam  math
0  internal1    32
1  internal2    39
2  internal3    32
3  internal4    21
4  internal5    21
5  internal6    39
6  internal7    32
7  internal8    40

df[['a','b','c']] gives a,b and c columns

In [52]:
df['stat']

0    29
1    35
2    32
3    15
4    37
5    21
6    20
7    35
Name: stat, dtype: int64

In [53]:
df['stat'].max()

37

df['a'].max() and df['a'].min() give maximum and minimum value in the (a)th column

In [54]:
df['math'].mean()

32.0

In [55]:
df['math'].std()

7.596991885890475

In [56]:
df['math'].describe()

count     8.000000
mean     32.000000
std       7.596992
min      21.000000
25%      29.250000
50%      32.000000
75%      39.000000
max      40.000000
Name: math, dtype: float64

## Conditional Selection of Data

In [57]:
df[df.stat>=30]

     date       exam  stat  math  coms  total
1  2/1/21  internal2    35    39    30    104
2  3/1/21  internal3    32    32    25     89
4  5/1/21  internal5    37    21    40     98
7  8/1/21  internal8    35    40    10     85

In [58]:
df[df.stat==32]

     date       exam  stat  math  coms  total
2  3/1/21  internal3    32    32    25     89

In [59]:
df[df.stat==df.stat.max()]

     date       exam  stat  math  coms  total
4  5/1/21  internal5    37    21    40     98

In [60]:
df[df.stat==df['stat'].max()]

     date       exam  stat  math  coms  total
4  5/1/21  internal5    37    21    40     98

In [62]:
df[['exam','date']][df.stat==df['stat'].max()]

        exam    date
4  internal5  5/1/21

In [63]:
df

     date       exam  stat  math  coms  total
0  1/1/21  internal1    29    32    30     91
1  2/1/21  internal2    35    39    30    104
2  3/1/21  internal3    32    32    25     89
3  4/1/21  internal4    15    21     7     43
4  5/1/21  internal5    37    21    40     98
5  6/1/21  internal6    21    39    30     90
6  7/1/21  internal7    20    32    20     72
7  8/1/21  internal8    35    40    10     85

NameError: name 'df' is not defined